Project/Toir/src/Reports/гкс_ПланФактПоЗаявкамНаРемонт/гкс_ПланФактПоЗаявкамНаРемонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>гкс_ПланФактПоЗаявкамНаРемонт</name>
</mdclass:Report>

Project/Toir/src/InformationRegisters/торо_АктуальныеПлановыеДатыРемонтов/торо_АктуальныеПлановыеДатыРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_АктуальныеПлановыеДатыРемонтов</name>
  <comment> //TOIR20-370: включенно индексирование для ДатаНачала и ДатаОкончания</comment>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КрайняяДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.торо_ДокументыПлановыхДатРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументНачалаЦепочки</name>
    <type>
      <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
      <types>DocumentRef.торо_ПланГрафикРемонта</types>
      <types>DocumentRef.торо_ГрафикРегламентныхМероприятийТОиР</types>
      <types>DocumentRef.торо_ВыявленныеДефекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ЭтоПереносРемонта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>IDРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ОстановочныеРемонты/торо_ОстановочныеРемонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ОстановочныеРемонты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Отвязан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>IDОсновного</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDЗависимого</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Удалить_ID_Корректировок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ТекущиеСтатусыСогласованияДокументов/торо_ТекущиеСтатусыСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ТекущиеСтатусыСогласованияДокументов</name>
  <resources>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </resources>
  <dimensions>
    <name>СогласуемыйДокумент</name>
    <type>
      <types>DefinedType.торо_СогласуемыеДокументы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_СтатусыДокументовЗаявокУстановленные/торо_СтатусыДокументовЗаявокУстановленные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СтатусыДокументовЗаявокУстановленные</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.торо_СтатусыДокументов</types>
    </type>
  </resources>
  <dimensions>
    <name>ИзменяемыйДокумент</name>
    <type>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/гкс_ТекущиеФМОР/гкс_ТекущиеФМОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ТекущиеФМОР</name>
  <resources>
    <name>ФМ</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </resources>
  <resources>
    <name>ТМ</name>
    <type>
      <types>CatalogRef.гкс_ТехническиеМеста</types>
    </type>
  </resources>
  <resources>
    <name>ТМФМ</name>
    <type>
      <types>CatalogRef.гкс_ТехническиеМеста</types>
    </type>
  </resources>
  <dimensions>
    <name>ОР</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/гкс_СрочностьВоздействия/гкс_СрочностьВоздействия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_СрочностьВоздействия</name>
  <enumValues>
    <name>Немедленно</name>
  </enumValues>
  <enumValues>
    <name>Сегодня</name>
  </enumValues>
  <enumValues>
    <name>ВТечениеНедели</name>
  </enumValues>
  <enumValues>
    <name>ВТечениеМесяца</name>
  </enumValues>
  <enumValues>
    <name>ПриСледующейОстановке</name>
  </enumValues>
  <enumValues>
    <name>БуфернаяРабота</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Reports/гкс_ПланФактПоЗаявкамНаРемонт/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	НастройкиКД = КомпоновщикНастроек.ПолучитьНастройки();
	ДопПараметры = Новый Структура("ДатаНачала,ДатаОкончания", Дата(1, 1, 1), Дата(3999, 1, 1));
	ПараметрПериод = Новый ПараметрКомпоновкиДанных("ПериодОтчета");
	ПараметрПодр = Новый ПараметрКомпоновкиДанных("Подразделение");
	ПараметрСтатус = Новый ПараметрКомпоновкиДанных("СтатусСогласования");
	
	Для Каждого СтрокаПараметр Из НастройкиКД.ПараметрыДанных.Элементы Цикл
		Если СтрокаПараметр.Использование Тогда
			Если СтрокаПараметр.Параметр = ПараметрПериод Тогда
				ДопПараметры.ДатаНачала = СтрокаПараметр.Значение.ДатаНачала;
				ДопПараметры.ДатаОкончания = СтрокаПараметр.Значение.ДатаОкончания;
			ИначеЕсли СтрокаПараметр.Параметр = ПараметрПодр Тогда
				ДопПараметры.Вставить("Подразделение", СтрокаПараметр.Значение);
			ИначеЕсли СтрокаПараметр.Параметр = ПараметрСтатус Тогда
				ДопПараметры.Вставить("Статус", СтрокаПараметр.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	////
	НастройкиОсновнойСхемы = КомпоновщикНастроек.ПолучитьНастройки();
	ВнешниеНаборыДанных = Новый Структура("ТабДанных1", ПолучитьОсновнуюТаблицу(ДопПараметры));
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКД, ДанныеРасшифровки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	ПроцессорВыводаВТабличныйДокумент = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВыводаВТабличныйДокумент.УстановитьДокумент(ДокументРезультат);	
	ПроцессорВыводаВТабличныйДокумент.Вывести(ПроцессорКомпоновкиДанных);
КонецПроцедуры

Функция ПолучитьОсновнуюТаблицу(ДопПараметры)
	#Область ПостроениеТаблицы
	ОпТипПриоритет = Новый ОписаниеТипов("СправочникСсылка.торо_КатегорииРиска");
	ОпТипОР = Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта");
	ОпТипВР = Новый ОписаниеТипов("СправочникСсылка.торо_ВидыРемонтов");
	ОпТипПодр = Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия");
	ОпТипОрг = Новый ОписаниеТипов("СправочникСсылка.Организации");
	ОпТипСогл = Новый ОписаниеТипов("СправочникСсылка.торо_СтатусыСогласованияДокументовРемонтныхРабот");
	ОпТипСмета = Новый ОписаниеТипов("ДокументСсылка.торо_ЗаявкаНаРемонт");
	ОпТипУчасток = Новый ОписаниеТипов("СправочникСсылка.гкс_Участки");
	ОпТипЗавод = Новый ОписаниеТипов("СправочникСсылка.гкс_ЗаводыИПодразделения");
	ОпТипМесто = Новый ОписаниеТипов("СправочникСсылка.гкс_МестаИПлощадки");
	// гкс+ [11.22] Деснол 17.11.2022
	ОпТипСпособСогл = Новый ОписаниеТипов("СправочникСсылка.торо_СпособыСогласованияДокументов");
	// гкс- [11.22] Деснол 17.11.2022
	// гкс+ [03.23] Деснол 20.03.2023
	ОпТипСтатус = Новый ОписаниеТипов("ПеречислениеСсылка.торо_СтатусыДокументов");
	// гкс- [03.23] Деснол 20.03.2023
	
	
	ОпТипСтрока36 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(36));
	ОпТипСтрока = Новый ОписаниеТипов("Строка");
	ОпТипБулево = Новый ОписаниеТипов("Булево");
	ОпТипДата = Новый ОписаниеТипов("Дата", , , , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
	ОпТипЧисло15_2 = Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2));
	//
	Таб = Новый ТаблицаЗначений();
	Таб.Колонки.Добавить("ПриоритетОР", ОпТипПриоритет);
	Таб.Колонки.Добавить("ИДРемонта", ОпТипСтрока36);
	Таб.Колонки.Добавить("КритичностьДефекта", ОпТипСтрока36);
	Таб.Колонки.Добавить("Срочность", ОпТипСтрока36);
	Таб.Колонки.Добавить("НомерСметы", ОпТипСтрока36);
	Таб.Колонки.Добавить("ВидРабот", ОпТипВР);
	Таб.Колонки.Добавить("НуженОстанов", ОпТипБулево);
	Таб.Колонки.Добавить("ОстановочныйРемонт", ОпТипСтрока36);
	Таб.Колонки.Добавить("Смета", ОпТипСмета);
	Таб.Колонки.Добавить("СтатусСогласованияСметы", ОпТипСогл);
	Таб.Колонки.Добавить("Организация", ОпТипОрг);
	Таб.Колонки.Добавить("Подразделение", ОпТипПодр);
	Таб.Колонки.Добавить("Место", ОпТипМесто);
	Таб.Колонки.Добавить("Завод", ОпТипЗавод);
	Таб.Колонки.Добавить("Участок", ОпТипУчасток);
	Таб.Колонки.Добавить("ТехНомер", ОпТипСтрока36);
	Таб.Колонки.Добавить("ОР", ОпТипОР);
	Таб.Колонки.Добавить("ОписаниеРемонта", ОпТипСтрока);
	Таб.Колонки.Добавить("Комментарий", ОпТипСтрока);
	Таб.Колонки.Добавить("Ответственный", ОпТипСтрока);
	Таб.Колонки.Добавить("Исполнитель", ОпТипСтрока);
	Таб.Колонки.Добавить("ДатаНачала", ОпТипДата);
	Таб.Колонки.Добавить("ДатаОкончания", ОпТипДата);
	Таб.Колонки.Добавить("КолвоПлан", ОпТипЧисло15_2);
	Таб.Колонки.Добавить("ВремяРаботыПлан", ОпТипЧисло15_2);
	Таб.Колонки.Добавить("ТрудозатратыПлан", ОпТипЧисло15_2);
	Таб.Колонки.Добавить("КолвоФакт", ОпТипЧисло15_2);
	Таб.Колонки.Добавить("ВремяРаботыФакт", ОпТипЧисло15_2);
	Таб.Колонки.Добавить("ТрудозатратыФакт", ОпТипЧисло15_2);
	Таб.Колонки.Добавить("СписокМЗ", ОпТипСтрока);
	Таб.Колонки.Добавить("СтоимостьПлан", ОпТипЧисло15_2);
	Таб.Колонки.Добавить("СтоимостьФакт", ОпТипЧисло15_2);
	// гкс+ [11.22] Деснол 17.11.2022
	Таб.Колонки.Добавить("СпособСоглСметы", ОпТипСпособСогл);
	// гкс- [11.22] Деснол 17.11.2022
	// гкс+ [03.23] Деснол 20.03.2023
	Таб.Колонки.Добавить("СтатусСметы", ОпТипСтатус);
	// гкс- [03.23] Деснол 20.03.2023
	// гкс+ [05.23] Деснол 05.05.2023
	ТЧПорядка = Новый ТаблицаЗначений();
	ТЧПорядка.Колонки.Добавить("Порядок", ОпТипЧисло15_2);
	ТЧПорядка.Колонки.Добавить("Срочность", Новый ОписаниеТипов("ПеречислениеСсылка.гкс_СрочностьВоздействия"));
	//
	НС = ТЧПорядка.Добавить();
	НС.Порядок = 1;
	НС.Срочность = Перечисления.гкс_СрочностьВоздействия.Немедленно;
	НС = ТЧПорядка.Добавить();
	НС.Порядок = 2;
	НС.Срочность = Перечисления.гкс_СрочностьВоздействия.Сегодня;
	НС = ТЧПорядка.Добавить();
	НС.Порядок = 3;
	НС.Срочность = Перечисления.гкс_СрочностьВоздействия.ВТечениеНедели;
	НС = ТЧПорядка.Добавить();
	НС.Порядок = 4;
	НС.Срочность = Перечисления.гкс_СрочностьВоздействия.ВТечениеМесяца;
	НС = ТЧПорядка.Добавить();
	НС.Порядок = 5;
	НС.Срочность = Перечисления.гкс_СрочностьВоздействия.ПриСледующейОстановке;
	НС = ТЧПорядка.Добавить();
	НС.Порядок = 6;
	НС.Срочность = Перечисления.гкс_СрочностьВоздействия.БуфернаяРабота;
	// гкс- [05.23] Деснол 05.05.2023
	#КонецОбласти
	//
	#Область ТекстЗапроса
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДатыРемонтов.IDРемонта КАК ИД_Ремонта,
		|	ДатыРемонтов.ДатаНачала КАК ДатаНачала,
		|	ДатыРемонтов.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТ_ВсеРемонты
		|ИЗ
		|	РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК ДатыРемонтов
		|ГДЕ
		|	ДатыРемонтов.ДатаНачала >= &ДатаНачала
		|	И ДатыРемонтов.ДатаНачала < &ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ОстановочныеРемонтыСрезПоследних.IDЗависимого КАК ИД_Ремонта,
		|	МАКСИМУМ(торо_ОстановочныеРемонтыСрезПоследних.Регистратор) КАК Регистратор
		|ПОМЕСТИТЬ ВТ_Остановочные
		|ИЗ
		|	РегистрСведений.торо_ОстановочныеРемонты.СрезПоследних(
		|			,
		|			IDЗависимого В
		|				(ВЫБРАТЬ
		|					ТЧ.ИД_Ремонта
		|				ИЗ
		|					ВТ_ВсеРемонты КАК ТЧ)) КАК торо_ОстановочныеРемонтыСрезПоследних
		|ГДЕ
		|	НЕ торо_ОстановочныеРемонтыСрезПоследних.Отвязан
		|
		|СГРУППИРОВАТЬ ПО
		|	торо_ОстановочныеРемонтыСрезПоследних.IDЗависимого
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ИД_Ремонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВсеРемонты.ИД_Ремонта КАК ИД_Ремонта,
		|	ВТ_ВсеРемонты.ДатаНачала КАК ДатаНачала,
		|	ВТ_ВсеРемонты.ДатаОкончания КАК ДатаОкончания,
		|	РемонтыЗаявки.Ссылка КАК Смета,
		|	РемонтыЗаявки.ОбъектРемонта КАК ОР,
		|	РемонтыЗаявки.ВидРемонтныхРабот КАК ВР,
		|	РемонтыЗаявки.ОписаниеРемонта КАК ОписаниеРемонта,
		|	РемонтыЗаявки.ОбъектРемонта.ТехНомер КАК ТехНомер,
		|	РемонтыЗаявки.ОбъектРемонта.гкс_КатегорияРиска КАК Приоритет,
		|	РемонтыЗаявки.КритичностьДефекта КАК Критичность
		|ПОМЕСТИТЬ ВТ_Заявки
		|ИЗ
		|	ВТ_ВсеРемонты КАК ВТ_ВсеРемонты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК РемонтыЗаявки
		|		ПО ВТ_ВсеРемонты.ИД_Ремонта = РемонтыЗаявки.ID
		|			И (РемонтыЗаявки.Ссылка.Проведен)  И &Отбор1
		|;
		|ВЫБРАТЬ
		|	ТЧ.Порядок КАК Порядок,
		|	ТЧ.Срочность КАК Срочность
		|Поместить ВТ_Порядок
		|ИЗ &ТЧПорядка КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Заявки.ИД_Ремонта КАК ИД_Ремонта,
		|	ВТ_Заявки.ДатаНачала КАК ДатаНачала,
		|	ВТ_Заявки.ДатаОкончания КАК ДатаОкончания,
		|	ВТ_Заявки.Смета КАК Смета,
		|	ВТ_Заявки.Смета.Номер КАК НомерСметы,
		|	ВТ_Заявки.ОР КАК ОР,
		|	ВТ_Заявки.ВР КАК ВР,
		|	ВТ_Заявки.Смета.Организация КАК Организация,
		|	ВТ_Заявки.Смета.СпособСогласования КАК СпособСоглСметы,
		|	ВТ_Заявки.Смета.Подразделение КАК Подразделение,
		|	ВТ_Заявки.Смета.гкс_НуженОстанов КАК НуженОстанов,
		|	ВТ_Заявки.ОписаниеРемонта КАК ОписаниеРемонта,
		|	ВТ_Заявки.ТехНомер КАК ТехНомер,
		|	ВТ_Заявки.Приоритет КАК Приоритет,
		|	ВТ_Заявки.Критичность КАК Критичность,
		|	ВТ_Заявки.Смета.Комментарий КАК Комментарий,
		|	ВТ_Заявки.Смета.Ответственный КАК Ответственный,
		|	ВТ_Заявки.Смета.гкс_СрочностьВоздействия КАК Срочность,
		|	ТекущиеСтатусы.СтатусДокумента КАК СтатусДокумента,
		|	ВТ_Остановочные.Регистратор КАК Остановочный,
		|	РегСтатусы.СтатусДокумента КАК СтатусСметы,
		|	ВТ_Заявки.Смета.гкс_ПлановаяСтоимостьРемонта КАК СтоимостьПлан,
		|	ВТ_Порядок.Порядок КАК Порядок
		|ИЗ
		|	ВТ_Заявки КАК ВТ_Заявки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущиеСтатусыСогласованияДокументов КАК ТекущиеСтатусы
		|		ПО ВТ_Заявки.Смета = ТекущиеСтатусы.СогласуемыйДокумент
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остановочные КАК ВТ_Остановочные
		|		ПО ВТ_Заявки.ИД_Ремонта = ВТ_Остановочные.ИД_Ремонта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтатусыДокументовЗаявокУстановленные.СрезПоследних() КАК РегСтатусы
		|		ПО ВТ_Заявки.Смета = РегСтатусы.ИзменяемыйДокумент
		|		Левое соединение ВТ_Порядок КАК ВТ_Порядок
		|		ПО ВТ_Порядок.Срочность = ВТ_Заявки.Смета.гкс_СрочностьВоздействия
		|Где &Отбор2
		|Упорядочить ПО ВТ_Порядок.Порядок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Заявки.ИД_Ремонта КАК ИД_Ремонта,
		|	ВТ_Заявки.Смета КАК Смета,
		|	ДокТЧ.Исполнитель КАК Исполнитель,
		|	ДокТЧ.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ВТ_Заявки КАК ВТ_Заявки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.ИсполнителиПоРемонтам КАК ДокТЧ
		|		ПО ВТ_Заявки.Смета = ДокТЧ.Ссылка
		|			И ВТ_Заявки.ИД_Ремонта = ДокТЧ.РемонтыОборудования_ID
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|ИТОГИ ПО
		|	ИД_Ремонта,
		|	Смета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Заявки.ИД_Ремонта КАК ИД_Ремонта,
		|	ВТ_Заявки.Смета КАК Смета,
		|	МатериальныеЗатраты.НомерСтроки КАК НомерСтроки,
		|	МатериальныеЗатраты.ЕдиницаИзмерения КАК Упаковка,
		|	МатериальныеЗатраты.Номенклатура КАК Номенклатура,
		|	МатериальныеЗатраты.Номенклатура.КОд КАК НоменклатураКод,
		|	МатериальныеЗатраты.КоличествоЕдиниц КАК Колво,
		|	МатериальныеЗатраты.Номенклатура.ЕдиницаИзмерения КАК ЕдИзм
		|ИЗ
		|	ВТ_Заявки КАК ВТ_Заявки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.МатериальныеЗатраты КАК МатериальныеЗатраты
		|		ПО ВТ_Заявки.ИД_Ремонта = МатериальныеЗатраты.РемонтыОборудования_ID
		|			И ВТ_Заявки.Смета = МатериальныеЗатраты.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|ИТОГИ ПО
		|	ИД_Ремонта,
		|	Смета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Заявки.ИД_Ремонта КАК ИД_Ремонта,
		|	ВТ_Заявки.Смета КАК Смета,
		|	ТрудовыеЗатраты.НомерСтроки КАК НомерСтроки,
		|	ТрудовыеЗатраты.ВремяРаботы КАК ВремяРаботы,
		|	ТрудовыеЗатраты.Квалификация КАК Квалификация,
		|	ТрудовыеЗатраты.Количество КАК Колво,
		|	ТрудовыеЗатраты.ID КАК ID
		|ИЗ
		|	ВТ_Заявки КАК ВТ_Заявки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.ТрудовыеЗатраты КАК ТрудовыеЗатраты
		|		ПО ВТ_Заявки.ИД_Ремонта = ТрудовыеЗатраты.РемонтыОборудования_ID
		|			И ВТ_Заявки.Смета = ТрудовыеЗатраты.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|ИТОГИ ПО
		|	ИД_Ремонта,
		|	Смета,
		|	ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Заявки.ИД_Ремонта КАК ИД_Ремонта,
		|	ВТ_Заявки.Смета КАК Смета,
		|	ДокументыОснования.Ссылка КАК Акт
		|ПОМЕСТИТЬ ВсеСметыАкты
		|ИЗ
		|	ВТ_Заявки КАК ВТ_Заявки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.ДокументыОснования КАК ДокументыОснования
		|		ПО ВТ_Заявки.Смета = ДокументыОснования.ДокументОснование
		|			И (ДокументыОснования.Ссылка.Проведен)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Заявки.ИД_Ремонта,
		|	ВТ_Заявки.Смета,
		|	ДокументыОснования.Ссылка
		|ИЗ
		|	ВТ_Заявки КАК ВТ_Заявки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.ДокументыОснования КАК ДокументыОснования
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.ДокументыОснования КАК НарядДокументыОснования
		|			ПО (НарядДокументыОснования.Ссылка = ДокументыОснования.ДокументОснование)
		|				И (ДокументыОснования.Ссылка.Проведен)
		|		ПО (ВТ_Заявки.Смета = НарядДокументыОснования.ДокументОснование)
		|			И (НарядДокументыОснования.Ссылка.Проведен)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВсеСметыАкты.ИД_Ремонта КАК ИД_Ремонта,
		|	ВсеСметыАкты.Смета КАК Смета,
		|	ВсеСметыАкты.Акт КАК Акт
		|ПОМЕСТИТЬ ВТ_СметаАкт
		|ИЗ
		|	ВсеСметыАкты КАК ВсеСметыАкты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК РемонтыОборудования
		|		ПО ВсеСметыАкты.ИД_Ремонта = РемонтыОборудования.ID
		|			И ВсеСметыАкты.Акт = РемонтыОборудования.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Заявки.ИД_Ремонта КАК ИД_Ремонта,
		|	ВТ_Заявки.Смета КАК Смета,
		|	МатериальныеЗатраты.НомерСтроки КАК НомерСтроки,
		|	МатериальныеЗатраты.ЕдиницаИзмерения КАК Упаковка,
		|	МатериальныеЗатраты.Номенклатура КАК Номенклатура,
		|	МатериальныеЗатраты.Номенклатура.Код КАК НоменклатураКод,
		|	МатериальныеЗатраты.КоличествоЕдиниц КАК Колво,
		|	МатериальныеЗатраты.Номенклатура.ЕдиницаИзмерения КАК ЕдИзм
		|ИЗ
		|	ВТ_СметаАкт КАК ВТ_Заявки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.МатериальныеЗатраты КАК МатериальныеЗатраты
		|		ПО ВТ_Заявки.ИД_Ремонта = МатериальныеЗатраты.РемонтыОборудования_ID
		|			И ВТ_Заявки.Акт = МатериальныеЗатраты.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|ИТОГИ ПО
		|	ИД_Ремонта,
		|	Смета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Заявки.ИД_Ремонта КАК ИД_Ремонта,
		|	ВТ_Заявки.Смета КАК Смета,
		|	ТрудовыеЗатраты.НомерСтроки КАК НомерСтроки,
		|	ТрудовыеЗатраты.ВремяРаботы КАК ВремяРаботы,
		|	ТрудовыеЗатраты.Сотрудник КАК Сотрудник,
		|	ТрудовыеЗатраты.Квалификация КАК Квалификация,
		|	ТрудовыеЗатраты.гкс_Количество КАК Колво,
		|	ТрудовыеЗатраты.ID КАК ID
		|ИЗ
		|	ВТ_СметаАкт КАК ВТ_Заявки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.ТрудовыеЗатраты КАК ТрудовыеЗатраты
		|		ПО ВТ_Заявки.ИД_Ремонта = ТрудовыеЗатраты.РемонтыОборудования_ID
		|			И ВТ_Заявки.Акт = ТрудовыеЗатраты.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|ИТОГИ ПО
		|	ИД_Ремонта,
		|	Смета,
		|	ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Заявки.ИД_Ремонта КАК ИД_Ремонта,
		|	ВТ_Заявки.Смета КАК Смета,
		|	ВТ_Заявки.Акт.гкс_СтоимостьРемонта КАК СтоимостьФакт
		|ИЗ
		|	ВТ_СметаАкт КАК ВТ_Заявки
		|ИТОГИ ПО
		|	ИД_Ремонта ;
		|ВЫБРАТЬ Различные
		|ВТ_Заявки.ОР КАК ОР,
		|	гкс_ТекущиеФМОР.ФМ КАК ФМ,
		|	гкс_ТекущиеФМОР.ТМ КАК ТМ,
		|	гкс_ТекущиеФМОР.ТМ.МестоПлощадка КАК Место,
		|	гкс_ТекущиеФМОР.ТМ.ЗаводПодразделение КАК Завод,
		|	гкс_ТекущиеФМОР.ТМ.Участок КАК Участок,
		|	гкс_ТекущиеФМОР.ТМФМ.МестоПлощадка КАК Место2,
		|	гкс_ТекущиеФМОР.ТМФМ.ЗаводПодразделение КАК Завод2,
		|	гкс_ТекущиеФМОР.ТМФМ.Участок КАК Участок2,
		|	гкс_ТекущиеФМОР.ТМФМ КАК ТМФМ
		|ИЗ
		|	ВТ_Заявки КАК ВТ_Заявки
		|	Внутреннее соединение РегистрСведений.гкс_ТекущиеФМОР КАК гкс_ТекущиеФМОР
		|	ПО гкс_ТекущиеФМОР.ОР = ВТ_Заявки.ОР
		| ";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДопПараметры.ДатаНачала);
	Запрос.УстановитьПараметр("ТЧПорядка", ТЧПорядка);
	Запрос.УстановитьПараметр("ДатаОкончания", ДопПараметры.ДатаОкончания);
	Если ДопПараметры.Свойство("Подразделение") Тогда 
		Запрос.УстановитьПараметр("Подразделение", ДопПараметры.Подразделение);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Отбор1", "РемонтыЗаявки.Ссылка.Подразделение В (&Подразделение)");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Отбор1", "Истина");
	КонецЕсли;
	Если ДопПараметры.Свойство("Статус") Тогда 
		Запрос.УстановитьПараметр("Статус", ДопПараметры.Статус);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Отбор2", "ТекущиеСтатусы.СтатусДокумента В (&Статус)");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Отбор2", "Истина");
	КонецЕсли;
	#КонецОбласти
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	НомерРем = 4;
	НомерИспСмета = 5;
	НомерМЗСмета = 6;
	НомерТЗСмета = 7;
	НомерМЗАкт = 10;
	НомерТЗАкт = 11;
	НомерАктИД = 12;
	НомерТМ = 13;
	ВыборкаРем = РезультатЗапроса[НомерРем].Выбрать();
	ВыборкаИспСметаИД = РезультатЗапроса[НомерИспСмета].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаМЗСметаИД = РезультатЗапроса[НомерМЗСмета].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаТЗСметаИД = РезультатЗапроса[НомерТЗСмета].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаМЗАктИД = РезультатЗапроса[НомерМЗАкт].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаТЗАктИД = РезультатЗапроса[НомерТЗАкт].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаАктИД = РезультатЗапроса[НомерАктИД].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаТМ = РезультатЗапроса[НомерТМ].Выбрать();
	Пока ВыборкаРем.Следующий() Цикл
		НоваяСтрока = Таб.Добавить();
		НоваяСтрока.ПриоритетОР = ВыборкаРем.Приоритет;
		НоваяСтрока.ИДРемонта = ВыборкаРем.ИД_Ремонта;
		НоваяСтрока.КритичностьДефекта = ВыборкаРем.Критичность;
		НоваяСтрока.ТехНомер = ВыборкаРем.ТехНомер;
		НоваяСтрока.ОписаниеРемонта = ВыборкаРем.ОписаниеРемонта;
		НоваяСтрока.НуженОстанов = ВыборкаРем.НуженОстанов;
		НоваяСтрока.Подразделение = ВыборкаРем.Подразделение;
		НоваяСтрока.Организация = ВыборкаРем.Организация;
		НоваяСтрока.ОР = ВыборкаРем.ОР;
		НоваяСтрока.ВидРабот = ВыборкаРем.ВР;
		НоваяСтрока.Смета = ВыборкаРем.Смета;
		НоваяСтрока.СпособСоглСметы = ВыборкаРем.СпособСоглСметы;
		НоваяСтрока.НомерСметы = ВыборкаРем.НомерСметы;
		НоваяСтрока.ДатаНачала = ВыборкаРем.ДатаНачала;
		НоваяСтрока.ДатаОкончания = ВыборкаРем.ДатаОкончания;
		НоваяСтрока.Комментарий = ВыборкаРем.Комментарий;
		НоваяСтрока.Ответственный = ВыборкаРем.Ответственный;
		НоваяСтрока.Срочность = ВыборкаРем.Срочность;
		НоваяСтрока.ОстановочныйРемонт = ВыборкаРем.Остановочный;
		НоваяСтрока.СтатусСогласованияСметы = ВыборкаРем.СтатусДокумента;
		НоваяСтрока.СтоимостьПлан = ВыборкаРем.СтоимостьПлан;
		// гкс+ [03.23] Деснол 20.03.2023
		НоваяСтрока.СтатусСметы = ВыборкаРем.СтатусСметы;
		// гкс- [03.23] Деснол 20.03.2023
				  
		#Область ИсполнителиСметы
		ВыборкаИспСметаИД.Сбросить();
		Если ВыборкаИспСметаИД.НайтиСледующий(Новый Структура("ИД_Ремонта", ВыборкаРем.ИД_Ремонта)) Тогда 
			ВыборкаИспСмета = ВыборкаИспСметаИД.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Если ВыборкаИспСмета.НайтиСледующий(Новый Структура("Смета", ВыборкаРем.Смета)) Тогда 
				ВыборкаИсп = ВыборкаИспСмета.Выбрать();
				Если ВыборкаИсп.Следующий() Тогда 
					НоваяСтрока.Исполнитель = ВыборкаИсп.Исполнитель;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		#КонецОбласти

#Область МатЗатраты
	ВыборкаМЗСметаИД.Сбросить();
	Если ВыборкаМЗСметаИД.НайтиСледующий(Новый Структура("ИД_Ремонта", ВыборкаРем.ИД_Ремонта)) Тогда 
		ВыборкаМЗСмета = ВыборкаМЗСметаИД.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Если ВыборкаМЗСмета.НайтиСледующий(Новый Структура("Смета", ВыборкаРем.Смета)) Тогда 
			МассивТекста = Новый Массив();
			ВыборкаМЗ = ВыборкаМЗСмета.Выбрать();
			Пока ВыборкаМЗ.Следующий() Цикл
				ТекстСтроки = Строка(ВыборкаМЗ.Номенклатура) + ": " + ВыборкаМЗ.Колво + " ";
				Если ЗначениеЗаполнено(ВыборкаМЗ.Упаковка) Тогда 
					ТекстСтроки = ТекстСтроки + Строка(ВыборкаМЗ.Упаковка);
				Иначе
					ТекстСтроки = ТекстСтроки + Строка(ВыборкаМЗ.ЕдИзм);
				КонецЕсли;
				ТекстСтроки = ТекстСтроки + "(" + ВыборкаМЗ.НоменклатураКод + ")";
				МассивТекста.Добавить(ТекстСтроки);
			КонецЦикла;
			НоваяСтрока.СписокМЗ = СтрСоединить(МассивТекста, "," + Символы.ПС);
		КонецЕсли;
	КонецЕсли;
#КонецОбласти

		#Область ТрудозатратыПлан
		ВыборкаТЗСметаИД.Сбросить();
		Если ВыборкаТЗСметаИД.НайтиСледующий(Новый Структура("ИД_Ремонта", ВыборкаРем.ИД_Ремонта)) Тогда 
			ВыборкаТЗСмета = ВыборкаТЗСметаИД.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Если ВыборкаТЗСмета.НайтиСледующий(Новый Структура("Смета", ВыборкаРем.Смета)) Тогда 
				СуммаВремени = 0;
				СуммаКвалификаций = 0;
				СуммаЗатрат = 0;
				МассивКвалификаций = Новый Массив();
				ВыборкаТЗРР = ВыборкаТЗСмета.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаТЗРР.Следующий() Цикл
					МассивВОперации = Новый Массив();
					ВыборкаТЗ = ВыборкаТЗРР.Выбрать();
					Если ВыборкаТЗ.Следующий() Тогда 
						ЭтоНовая = Истина;
						Для Каждого СтрокаМассива Из МассивВОперации Цикл
							Если СтрокаМассива.Квал = ВыборкаТЗ.Квалификация Тогда 
								СтрокаМассива.Колво = СтрокаМассива.Колво + ВыборкаТЗ.Колво;
								ЭтоНовая = ложь;
								Прервать;
							КонецЕсли;
						КонецЦикла;
						Если ЭтоНовая Тогда 
							МассивВОперации.Добавить(Новый Структура("Квал,Колво", ВыборкаТЗ.Квалификация, ВыборкаТЗ.Колво));
						КонецЕсли;
						СуммаВремени = СуммаВремени + ВыборкаТЗ.ВремяРаботы;
						СуммаЗатрат = СуммаЗатрат + (ВыборкаТЗ.Колво * ВыборкаТЗ.ВремяРаботы);
					КонецЕсли;
					Для Каждого СтрокаТЗ Из МассивВОперации Цикл
						ЭтоНовая = Истина;
						Для Каждого СтрокаМассива Из МассивКвалификаций Цикл
							Если СтрокаМассива.Квал = СтрокаТЗ.Квал Тогда 
								СтрокаМассива.Колво = Макс(СтрокаМассива.Колво, СтрокаТЗ.Колво);
								ЭтоНовая = ложь;
								Прервать;
							КонецЕсли;
						КонецЦикла;
						Если ЭтоНовая Тогда 
							МассивКвалификаций.Добавить(Новый Структура("Квал,Колво", СтрокаТЗ.Квал, СтрокаТЗ.Колво));
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
				Для Каждого СтрокаМассива Из МассивКвалификаций Цикл
					СуммаКвалификаций = СуммаКвалификаций + СтрокаМассива.Колво;
				КонецЦикла;
				НоваяСтрока.КолвоПлан = СуммаКвалификаций;
				НоваяСтрока.ВремяРаботыПлан = (СуммаВремени / 3600);
				НоваяСтрока.ТрудозатратыПлан = (СуммаЗатрат / 3600);
			КонецЕсли;
		КонецЕсли;
		#КонецОбласти

	#Область ТрудозатратыФакт
	ВыборкаТЗАктИД.Сбросить();
	Если ВыборкаТЗАктИД.НайтиСледующий(Новый Структура("ИД_Ремонта", ВыборкаРем.ИД_Ремонта)) Тогда 
		ВыборкаТЗСмета = ВыборкаТЗАктИД.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Если ВыборкаТЗСмета.НайтиСледующий(Новый Структура("Смета", ВыборкаРем.Смета)) Тогда 
			СуммаВремени = 0;
			СуммаКвалификаций = 0;
			СуммаЗатрат = 0;
			МассивКвалификаций = Новый Массив();
			ВыборкаТЗРР = ВыборкаТЗСмета.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаТЗРР.Следующий() Цикл
				МассивВОперации = Новый Массив();
				ВыборкаТЗ = ВыборкаТЗРР.Выбрать();
				Если ВыборкаТЗ.Следующий() Тогда 
					ТекКвал = ВыборкаТЗ.Квалификация;
					Если ЗначениеЗаполнено(ВыборкаТЗ.Сотрудник) Тогда 
						ТекКвал = ВыборкаТЗ.Сотрудник;
					КонецЕсли;
					ЭтоНовая = Истина;
					Для Каждого СтрокаМассива Из МассивВОперации Цикл
						Если СтрокаМассива.Квал = ТекКвал Тогда 
							Если ВыборкаТЗ.Колво = 0 Тогда 
								СтрокаМассива.Колво = СтрокаМассива.Колво + 1;
							Иначе
								СтрокаМассива.Колво = СтрокаМассива.Колво + ВыборкаТЗ.Колво;
							КонецЕсли;
							ЭтоНовая = ложь;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Если ЭтоНовая Тогда 
						Если ВыборкаТЗ.Колво = 0 Тогда 
							МассивВОперации.Добавить(Новый Структура("Квал,Колво", ТекКвал, 1));
						Иначе
							МассивВОперации.Добавить(Новый Структура("Квал,Колво", ТекКвал, ВыборкаТЗ.Колво));
						КонецЕсли;
					КонецЕсли;
					СуммаВремени = СуммаВремени + ВыборкаТЗ.ВремяРаботы;
					Если ВыборкаТЗ.Колво = 0 Тогда 
						СуммаЗатрат = СуммаЗатрат + (ВыборкаТЗ.ВремяРаботы);
					Иначе
						СуммаЗатрат = СуммаЗатрат + (ВыборкаТЗ.Колво * ВыборкаТЗ.ВремяРаботы);
					КонецЕсли;
				КонецЕсли;
				Для Каждого СтрокаТЗ Из МассивВОперации Цикл
					ЭтоНовая = Истина;
					Для Каждого СтрокаМассива Из МассивКвалификаций Цикл
						Если СтрокаМассива.Квал = СтрокаТЗ.Квал Тогда 
							СтрокаМассива.Колво = Макс(СтрокаМассива.Колво, СтрокаТЗ.Колво);
							ЭтоНовая = ложь;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Если ЭтоНовая Тогда 
						МассивКвалификаций.Добавить(Новый Структура("Квал,Колво", СтрокаТЗ.Квал, СтрокаТЗ.Колво));
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			Для Каждого СтрокаМассива Из МассивКвалификаций Цикл
				СуммаКвалификаций = СуммаКвалификаций + СтрокаМассива.Колво;
			КонецЦикла;
			НоваяСтрока.КолвоФакт = СуммаКвалификаций;
			НоваяСтрока.ВремяРаботыФакт = (СуммаВремени / 3600);
			НоваяСтрока.ТрудозатратыФакт = (СуммаЗатрат / 3600);
		КонецЕсли;
	КонецЕсли;
	#КонецОбласти
	
	ВыборкаАктИД.Сбросить();
	Если ВыборкаАктИД.НайтиСледующий(Новый Структура("ИД_Ремонта", ВыборкаРем.ИД_Ремонта)) Тогда 
		ВыборкаАкт = ВыборкаАктИД.Выбрать();
		Если ВыборкаАкт.НайтиСледующий(Новый Структура("Смета", ВыборкаРем.Смета)) Тогда 
			НоваяСтрока.СтоимостьФакт = ВыборкаАкт.СтоимостьФакт;
		КонецЕсли;
	КонецЕсли;
	
	ВыборкаТМ.Сбросить();
	Если ВыборкаТМ.НайтиСледующий(Новый Структура("ОР", ВыборкаРем.ОР)) Тогда 
		Если ЗначениеЗаполнено(ВыборкаТМ.ТМ) Тогда 
			НоваяСтрока.Место = ВыборкаТМ.Место;
			НоваяСтрока.Завод = ВыборкаТМ.Завод;
			НоваяСтрока.Участок = ВыборкаТМ.Участок;
		Иначе
			НоваяСтрока.Место = ВыборкаТМ.Место2;
			НоваяСтрока.Завод = ВыборкаТМ.Завод2;
			НоваяСтрока.Участок = ВыборкаТМ.Участок2;
		КонецЕсли;
	КонецЕсли;
		
	КонецЦикла;
	//
	Возврат Таб;
КонецФункции
